{
  "Home": {
    "givingly": "Givingly, Recoded'daki bitirme projem, web geliştirme yolculuğumdaki önemli bir kilometre taşını simgeliyor. Frontend geliştirici olarak büyüme sürecimi ve ekip çalışması, teknik yetenekler, problem çözme ve sürekli öğrenme kabiliyetimi yansıtıyor. Givingly, bireyleri ve projeleri potansiyel destekçilerin bir topluluğuyla bir araya getirmeyi amaçlayan bir bağış platformudur.",
    "cineverse": "The Movie Database Projesi, ilgili ve özellik zengini bir film veritabanı web sitesi oluşturmayı hedefleyen işbirlikçi bir çabadır. Yetenekli geliştiriciler ekibiyle yakın işbirliği yapmayı içermekte ve film tutkunları için kapsamlı bir platform oluşturmayı amaçlamaktadır. Bu proje, farklı teknolojileri ve API'ları keşfetmemize ve kullanmamıza izin verdi, böylece dinamik ve kullanıcı dostu bir film deneyimi yaratmayı başardık.",
    "memeGenerator": "Next.js ve api.imgflip.com API tarafından desteklenen Meme Oluşturucu, frontend geliştirme konusundaki yeteneğimi göstermektedir. Bu Next.js uygulaması, kullanıcıların metin girmesi ve renk seçmesiyle mizahlar oluşturmasına ve önizlemesine olanak tanır. Next.js, API entegrasyonu, Redux Toolkit ile durum yönetimi ve kullanıcı dostu arayüz tasarımındaki becerilerimi sergiliyor. Next.js sunucu tarafı işlemesi ve etkili form işleme için React Hook Form kullanarak bu proje hızlı, duyarlı ve görsel olarak çekici bir kullanıcı deneyimi sunar.",
    "shopfinity": "Bu proje, kullanıcıların favori filmlerini veya dizilerini aday göstermelerine izin vermek için inşa edilmiş bir Next.js uygulamasıdır. Veri çekmek için React Query kullanır, yükleme durumlarını yönetir ve hata işleme yapar. Proje ayrıca stil için Tailwind CSS, UI öğeleri için Material-UI bileşenleri ve useEffect ve yerel depolama kullanır.",
    "weatherapp": "React Weather App ile gerçek zamanlı hava durumu güncellemelerinin tadını çıkarın! Context API ve useContext hook'larını kullanarak bileşenler arasında sorunsuz durum yönetimi için çaba sarf ettim. Axios'u kullanarak Hava Durumu API'sinden veri çektim, doğru tahminler sağladım. Uygulama, veri alımı sırasında şık bir Spinner Component içeriyor ve bir Hata Bileşeni API Fetch hatalarını zarif bir şekilde ele alıyor. Bu proje, React becerilerimi geliştirdi ve durum yönetimi, asenkron veri çekme ve UI/UX iyileştirmelerini kapsadı. Hava durumunu hiç böyle keşfedin!",
    "thebeatlesfanpage": "Sevdiğim müzik grubu The Beatles'a adanmış bu web sayfasına adım atın. HTML, Tailwind CSS ve Vanilla JavaScript ile oluşturulan her satır, kodun her noktasında favori grubumun zamansız melodilerini yankılamaktadır. Kendinizi, The Fab Four'un müzikal yolculuğunun özünü yakalayan dinamik görseller ve akıcı etkileşimlere bırakın."
  },
  "Navbar": {
    "work": "İşlerim",
    "about": "Hakkımda",
    "lets": "Hadi Konuşalım"
  },
  "HeroSection": {
    "I am a": "Ben bir",
    "heroSectionText": "Ön yüz geliştirme konusunda uzmanlaşmış biriyim, detaylara dikkat eden ve yaratıcı problem çözme yeteneği olan etkili çözümler sunuyorum. Hem bağımsız çalışmayı hem de işbirliği gerektiren takım ortamlarında başarılıyım, web geliştirmeye adanmış ve sürekli iyileşmeye kararlıyım.",
    "Frontend Developer": "Ön Yüz Geliştiriciyim",
    "Web Developer": "Web Geliştiriciyim",
    "Mechanical Engineer": "Makine Mühendisiyim",
    "Download CV": "Özgeçmişi İndir"
  },
  "WorksIntro": {
    "SomeOfMyWork": "Çalışmalarımdan Bazıları.",
    "firstText": "Web geliştirme aracılığıyla fikirleri hayata geçirmek beni heyecanlandırıyor. Mekanik mühendislik geçmişimle frontend çalışmalarına benzersiz bir bakış açısı getiriyorum. Organizasyon, sistemli düşünce ve etkili problem çözme konularına odaklanıyorum.",
    "secondText": "React ve Next.js konusunda uzmanlaşmış olarak, çeşitli modern web teknolojilerini kullanarak etkileyici kullanıcı arayüzleri oluşturuyorum. Web geliştirici olarak, en güçlü yanlarım açıklık ve merak; bu özellikler, her projeye teknoloji ile karmaşık sorunları analiz etme ve çözme motivasyonu sağlıyor.",
    "thirdText": "İlgili olduğum bazı teknolojiler:",
    "fourthText": "Aşağıda, üzerinde çalışmaktan mutluluk duyduğum bazı projelerin açıklamalarını ve bağlantılarını bulacaksınız."
  },
  "Work": {
    "VisitAt": "Ziyaret et"
  },
  "About": {
    "HeyThere": "Merhaba!",
    "firstText": "Etkileyici web deneyimleri oluşturma tutkusuna sahip bir Ön Yüz Geliştiriciyim.",
    "secondText": "Alanında bir mühendis olarak çalıştıktan sonra, gerçek tutkumu web geliştirmede keşfettiğimde yolculuğum bir döneme girdi. Mekanik Mühendislik geçmişimle, işime benzersiz bir bakış açısı getiriyor, yaratıcılığı organizasyon, sistemli düşünme ve etkili problem çözme temeliyle birleştiriyorum.",
    "thirdText": "Re:Coded'da yoğun 6 aylık bir web geliştirme bootcamp'ini başarıyla tamamlayarak becerilerimi geliştirdim. 500 saatten fazla uygulamalı öğrenme ve projeye dayalı deneyim kazandım. Bu dönüştürücü deneyim, web geliştirmeye olan bağlılığımı pekiştirdi.",
    "fourthText": "Birlikte olağanüstü bir şeyler inşa edelim. Portföyümü keşfedin ve bağlantı kurmamıza izin verin!",
    "YouCanFindMeOn": "Beni şurada bulabilirsiniz:",
    "OrSendMeAnEmailAt": "veya bana bir e-posta gönderin",
    "DownloadCV": "Özgeçmişi İndir"
  },
  "Contact": {
    "ConnectWithMe": "Benimle İletişime Geçin",
    "LetsCollaborate": "İşbirliği Yapalım",
    "YourName": "Adınız",
    "YourEmail": "E-postanız",
    "YourMessage": "Mesajınız",
    "SendMessage": "Mesaj Gönder"
  },
  "Footer": {
    "AllRightsReserved": "Tüm hakları saklıdır"
  }
}