{
  "Home": {
    "givingly": "Recoded'daki bitirme projem, web geliştirme serüvenimde önemli bir kilometre taşıdır. Frontend geliştirici olarak gösterdiğim büyüme ve ekip çalışması, teknik beceriler, problem çözme ve sürekli öğrenme yeteneklerimi yansıtır. Givingly, bireyleri ve projeleri potansiyel destekçilerle buluşturan bir bağış platformudur.",
    "cineverse": "The Movie Database Projesi, etkileşimli bir film veritabanı web sitesi oluşturmayı amaçlayan işbirlikçi bir çabadır. Yetenekli bir ekiple yakın çalışarak, film tutkunları için kapsamlı bir platform inşa ettik. Proje, çeşitli teknolojileri ve API'ları keşfetmeme ve kullanmama izin verdi.",
    "memeGenerator": "Next.js ve api.imgflip.com API ile desteklenen Meme Oluşturucu, frontend geliştirme becerilerimi sergiler. Kullanıcılar metin girerek ve renk seçerek mizah oluşturabilir ve önizleme yapabilir. Next.js, API entegrasyonu, Redux Toolkit ve kullanıcı dostu arayüz tasarımındaki becerilerimi gösterir.",
    "shopfinity": "Shopfinity, kullanıcılara favori filmlerini veya dizilerini aday gösterme olanağı sunan bir Next.js uygulamasıdır. Veri çekmek için React Query kullanır, Tailwind CSS ile stil verir ve Material-UI bileşenleriyle zenginleştirilmiş bir deneyim sunar.",
    "weatherapp": "React Hava Durumu Uygulaması ile gerçek zamanlı hava durumu güncellemelerini keşfedin! Context API, useContext hook ve Axios kullanılarak veri çekme, durum yönetimi, asenkron veri çekme ve UI/UX iyileştirmelerini kapsayan bir proje.",
    "thebeatlesfanpage": "Kendinizi The Beatles'in büyülü dünyasına adayın. HTML, Tailwind CSS ve Vanilla JavaScript ile oluşturulan her satır, kodun her noktasında favori grubumun zamansız melodilerini yankılar.",
    "dilersigorta": "An insurance website designed to deliver comprehensive insurance solutions to clients with a focus on server-side rendering power and robust SEO capabilities. Leveraged Next.js for server-side rendering, ensuring improved performance. Ensured platform reliability, security, and scalability through rigorous testing and optimization. Tools: Next.js, Tailwind CSS"
  },
  "Navbar": {
    "work": "İşlerim",
    "about": "Hakkımda",
    "lets": "Hadi Konuşalım"
  },
  "HeroSection": {
    "I am a": "Ben bir",
    "heroSectionText": "Ön yüz geliştirme konusunda uzmanlaşmış biriyim, detaylara dikkat eden ve yaratıcı problem çözme yeteneği olan etkili çözümler sunuyorum. Hem bağımsız çalışmayı hem de işbirliği gerektiren takım ortamlarında başarılıyım, web geliştirmeye adanmış ve sürekli iyileşmeye kararlıyım.",
    "Frontend Developer": "Ön Yüz Geliştiriciyim",
    "Web Developer": "Web Geliştiriciyim",
    "Mechanical Engineer": "Makine Mühendisiyim",
    "Download CV": "Özgeçmişi İndir"
  },
  "WorksIntro": {
    "SomeOfMyWork": "Çalışmalarımdan Bazıları.",
    "firstText": "Web geliştirme aracılığıyla fikirleri hayata geçirmek beni heyecanlandırıyor. Mekanik mühendislik geçmişimle frontend çalışmalarına benzersiz bir bakış açısı getiriyorum. Organizasyon, sistemli düşünce ve etkili problem çözme konularına odaklanıyorum.",
    "secondText": "React ve Next.js konusunda uzmanlaşmış olarak, çeşitli modern web teknolojilerini kullanarak etkileyici kullanıcı arayüzleri oluşturuyorum. Web geliştirici olarak, en güçlü yanlarım açıklık ve merak; bu özellikler, her projeye teknoloji ile karmaşık sorunları analiz etme ve çözme motivasyonu sağlıyor.",
    "thirdText": "İlgili olduğum bazı teknolojiler:",
    "fourthText": "Aşağıda, üzerinde çalışmaktan mutluluk duyduğum bazı projelerin açıklamalarını ve bağlantılarını bulacaksınız."
  },
  "Work": {
    "VisitAt": "Ziyaret et"
  },
  "About": {
    "HeyThere": "Merhaba!",
    "firstText": "Etkileyici web deneyimleri oluşturma tutkusuna sahip bir Ön Yüz Geliştiriciyim.",
    "secondText": "Mühendislikten web geliştirmeye olan gerçek tutkumu keşfettim. Makine Mühendislik geçmişim, yaratıcılığı organizasyon, sistemli düşünme ve etkili problem çözmeyle birleştiriyor.",
    "thirdText": "Re:Coded'da 6 aylık yoğun web geliştirme bootcamp'inde becerilerimi geliştirdim. Bu dönüştürücü deneyim, web geliştirmeye olan bağlılığımı pekiştirdi.",
    "fourthText": "Birlikte olağanüstü projeler gerçekleştirelim. Portföyümü keşfedin ve iletişim kurmaktan çekinmeyin!",
    "YouCanFindMeOn": "Beni şurada bulabilirsiniz:",
    "OrSendMeAnEmailAt": "veya bana e-posta gönderebilirsiniz",
    "DownloadCV": "Özgeçmişi İndir"
  },
  "Contact": {
    "ConnectWithMe": "Benimle İletişime Geçin",
    "LetsCollaborate": "İşbirliği Yapalım",
    "YourName": "Adınız",
    "YourEmail": "E-postanız",
    "YourMessage": "Mesajınız",
    "SendMessage": "Mesaj Gönder"
  },
  "Footer": {
    "AllRightsReserved": "Tüm hakları saklıdır"
  }
}